In [1]:
import pandas as pd
import sys
import sqlite3

In [2]:
connection = sqlite3.connect("spaceTable.db")
print("Opened database successfully")

Opened database successfully

In [3]:
cursor = connection.cursor()

In [4]:
sql_command = """ CREATE TABLE space(
                                       flight_number INTEGER PRIMARY KEY,
                                       launch_date DATE,
                                       payload_mass INTEGER,
                                       orbit VARCHAR(30),
                                       organizations VARCHAR(30), 
                                       mission_outcome VARCHAR(30)
                                    );"""

In [5]:
cursor.execute(sql_command)
print("Table created successfully")

Table created successfully

In [6]:
cursor.execute(sql_command)
print("Table created successfully")

OperationalError: table space already exists

In [7]:
sql_command = """INSERT INTO space VALUES (104, "2018-01-04", "525", "LEO", "NASA", "Success");"""
cursor.execute(sql_command)

In [8]:
sql_command = """INSERT INTO space VALUES (104, "2018-01-04", "525", "LEO", "NASA", "Success");"""
cursor.execute(sql_command)

IntegrityError: UNIQUE constraint failed: space.flight_number

In [9]:
sql_command = """INSERT INTO space VALUES (222, "2018-02-22", "4230", "Polar LEO", "NASA", "Success");"""
cursor.execute(sql_command)

In [10]:
sql_command = """INSERT INTO space VALUES (306, "2018-03-06", "6092", "GTO", "NASA", "Failure");"""
cursor.execute(sql_command)

In [11]:
sql_command = """INSERT INTO space VALUES (402, "2018-04-02", "2647", "LEO", "SES", "Success");"""
cursor.execute(sql_command)

In [12]:
sql_command = """INSERT INTO space VALUES (418, "2018-04-18", "362", "GTO", "AFSPC", "Success");"""
cursor.execute(sql_command)

In [13]:
sql_command = """INSERT INTO space VALUES (511, "2018-05-11", "6460", "Polar LEO", "SES", "Failure");"""
cursor.execute(sql_command)

In [14]:
sql_command = """INSERT INTO space VALUES (604, "2018-06-04", "5384", "GTO", "AFSPC", "Failure");"""
cursor.execute(sql_command)

In [15]:
connection.commit()

In [16]:
connection.close()

In [17]:
connection = sqlite3.connect("spaceTable.db")

In [18]:
cursor = connection.cursor()

In [19]:
cursor.execute("SELECT * FROM space")

In [20]:
space_data = cursor.fetchall() 
space_data

[(104, '2018-01-04', 525, 'LEO', 'NASA', 'Success'),
 (222, '2018-02-22', 4230, 'Polar LEO', 'NASA', 'Success'),
 (306, '2018-03-06', 6092, 'GTO', 'NASA', 'Failure'),
 (402, '2018-04-02', 2647, 'LEO', 'SES', 'Success'),
 (418, '2018-04-18', 362, 'GTO', 'AFSPC', 'Success'),
 (511, '2018-05-11', 6460, 'Polar LEO', 'SES', 'Failure'),
 (604, '2018-06-04', 5384, 'GTO', 'AFSPC', 'Failure')]

In [21]:
space_df = pd.DataFrame(data = list(space_data),
                         columns = ['flight_number', 'launch_date',
                                    'payload_mass', 'orbit',
                                    'organizations', 'mission_outcome']
                        )

In [22]:
space_df

,flight_number,launch_date,payload_mass,orbit,organizations,mission_outcome
0,104,2018-01-04,525,LEO,NASA,Success
1,222,2018-02-22,4230,Polar LEO,NASA,Success
2,306,2018-03-06,6092,GTO,NASA,Failure
3,402,2018-04-02,2647,LEO,SES,Success
4,418,2018-04-18,362,GTO,AFSPC,Success
5,511,2018-05-11,6460,Polar LEO,SES,Failure
6,604,2018-06-04,5384,GTO,AFSPC,Failure

In [23]:
cursor.execute(" Select * from space where organizations = 'NASA' ")

In [24]:
org_name = cursor.fetchall()

In [25]:
nasa_df = pd.DataFrame(data = list(org_name),
                         columns = ['flight_number', 'launch_date',
                                    'payload_mass', 'orbit',
                                    'organizations', 'mission_outcome'])

In [26]:
nasa_df

,flight_number,launch_date,payload_mass,orbit,organizations,mission_outcome
0,104,2018-01-04,525,LEO,NASA,Success
1,222,2018-02-22,4230,Polar LEO,NASA,Success
2,306,2018-03-06,6092,GTO,NASA,Failure

In [27]:
cursor.execute(" Select * from space where mission_outcome = 'Success' ")

In [28]:
success_mission = cursor.fetchall()

In [29]:
success_df = pd.DataFrame(data = list(success_mission),
                          columns = ['flight_number', 'launch_date',
                                    'payload_mass', 'orbit',
                                    'organizations', 'mission_outcome']
                         )

In [30]:
success_df

,flight_number,launch_date,payload_mass,orbit,organizations,mission_outcome
0,104,2018-01-04,525,LEO,NASA,Success
1,222,2018-02-22,4230,Polar LEO,NASA,Success
2,402,2018-04-02,2647,LEO,SES,Success
3,418,2018-04-18,362,GTO,AFSPC,Success

In [31]:
cursor.execute("DELETE from space where mission_outcome = 'Failure' ")

In [32]:
fail_mission = cursor.fetchall()

In [33]:
fail_df = pd.DataFrame(data = list(fail_mission),
                          columns = ['flight_number', 'launch_date',
                                    'payload_mass', 'orbit',
                                    'organizations', 'mission_outcome']
                      )
print("The corresponding rows have been deleted")

The corresponding rows have been deleted

In [34]:
fail_df

Empty DataFrame
Columns: [flight_number, launch_date, payload_mass, orbit, organizations, mission_outcome]
Index: []

In [35]:
cursor.execute("Select * from space")

In [36]:
space_data_1 = cursor.fetchall()

In [37]:
space_modified_df = pd.DataFrame(data = list(space_data_1),
                              columns = ['flight_number', 'launch_date',
                                         'payload_mass', 'orbit',
                                         'organizations', 'mission_outcome']
                                )

In [38]:
space_modified_df

,flight_number,launch_date,payload_mass,orbit,organizations,mission_outcome
0,104,2018-01-04,525,LEO,NASA,Success
1,222,2018-02-22,4230,Polar LEO,NASA,Success
2,402,2018-04-02,2647,LEO,SES,Success
3,418,2018-04-18,362,GTO,AFSPC,Success

In [39]:
connection.commit()
connection.close()

In [40]:
space_data_1

[(104, '2018-01-04', 525, 'LEO', 'NASA', 'Success'),
 (222, '2018-02-22', 4230, 'Polar LEO', 'NASA', 'Success'),
 (402, '2018-04-02', 2647, 'LEO', 'SES', 'Success'),
 (418, '2018-04-18', 362, 'GTO', 'AFSPC', 'Success')]

In [41]:
connection = sqlite3.connect("spaceTable.db")

In [42]:
cursor = connection.cursor()

In [43]:
cursor.execute("DROP table space")
print("The table is Dropped")

The table is Dropped

In [44]:
connection.close()

In [45]:
connection = sqlite3.connect("spaceTable.db")

In [46]:
cursor = connection.cursor()

In [48]:
cursor.execute("SELECT * from space")

OperationalError: no such table: space